import React, { useState } from "react";
import PageTitle from "../../component/PageTitle";

export default function LawNavi() {
  const [props, setprops] = useState({
    title: "이용약관",
    nav1: "이용약관",
    nav2: "개인정보 처리방침",
    nav3: "위치기반 서비스 이용약관",
    nav4: "청소년 보호방침",
    nav5: "영상정보처리기기 운영관리방침",
    // breadcrumbLink: "/law/personal",
    link1: "/law",
    link2: "/law/personal",
    link3: "/law/navi",
    link4: "/law/teen",
    link5: "/law/video",
  });
  return (
    <div className="content">
      {/* ----- 페이지 타이틀 ----- */}
      <PageTitle props={props} />
      {/* ----- 본문 ----- */}
      <ul>
        <li>
          <h3>제1조 목적</h3>
          <p>
            이 약관은 청오디피케이㈜(이하 “회사”)가 제공하는 위치기반서비스(이하
            “서비스”)를 이용함에 있어 회사와 이용자의 권리, 의무 및 책임사항,
            기타 필요한 사항에 따른 이용 조건 및 절차 등 기본적인 사항을
            규정함을 목적으로 합니다.
          </p>
        </li>
        <li>
          <h3>제2조 이용약관의 효력 및 변경</h3>
          <ul>
            <li>
              (1) 본 약관은 서비스를 신청한 이용자 또는 개인위치정보주체가 본
              약관을 확인하고 회사가 정한 소정의 절차에 따라 동의해야 효력이
              발생합니다.
            </li>
            <li>
              (2) 이용자가 온라인에서 본 약관의 "동의하기" 버튼을 클릭하였을
              경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 적용에
              동의한 것으로 봅니다.
            </li>
            <li>
              (3) 회사는 서비스에 새로운 업무 적용, 정부에 의한 시정명령의 이행
              및 기타 회사의 업무상 약관을 변경해야 할 중요한 사유가 있다고
              판단될 경우 본 약관을 변경할 수 있습니다.
            </li>
            <li>
              (4) 이용자와 계약을 체결한 서비스가 기술적 사양의 변경 등의 사유로
              변경할 경우에는 그 사유를 이용자에게 통지 가능한 수단으로 즉시
              통지합니다.
            </li>
            <li>
              (5) 회사는 본 약관을 변경할 경우에는 변경된 약관과 사유를 적용일자
              1주일 전까지 홈페이지에 게시하거나 이용자에게 전자적
              형태(전자우편, SMS, 앱 푸시 등)로 공지하며, 이용자가 그 기간 안에
              이의제기가 없거나, 본 서비스를 이용할 경우 이를 승인한 것으로
              봅니다.
            </li>
            <li>
              (6) 본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에
              명시되지 아니한 사항에 대하여는 관계법령 또는 상관례에 따릅니다.
            </li>
          </ul>
        </li>
        <li>
          <h3>제3조 서비스 내용 및 위치정보 수집방법</h3>
          <ul>
            <li>
              (1) 회사가 제공하는 위치기반 서비스를 이용하기 위한 통신 비용은
              기본적으로 무료이며 이용자가 이동통신사업자에 지불하는 통신요금
              외의 요금은 추가적으로 없습니다.
            </li>
            <li>
              <p>(2) 회사는 다음과 같이 위치정보를 수집합니다.</p>
              <p>- GPS가 포함된 모바일기기의 GPS정보를 통한 위치정보 수집</p>
              <p>
                - 인터넷망을 통해 접속 시 인터넷서비스사업자로부터 제공받는
                위치정보 수집
              </p>
            </li>
            <li>
              (3) 회사는 제공받은 위치정보, 상태정보를 이용하여 다음의 내용을
              서비스 합니다.
            </li>
          </ul>
          <table border="1px">
            <tr>
              <td>서비스 내용</td>
              <td>서비스 대상</td>
              <td>비고</td>
            </tr>
            <tr>
              <td>* 주변 매장 찾기/현 위치로 매장 검색 (인근 매장정보 제공)</td>
              <td>온라인 주문 (웹사이트 및 모바일App)</td>
              <td>회원 및 비회원</td>
            </tr>
            <tr>
              <td>* 현위치로 배달주소 설정</td>
              <td>온라인 주문 (웹사이트 및 모바일App)</td>
              <td>회원 및 비회원</td>
            </tr>
            <tr>
              <td>
                * 드라이빙 픽업 서비스 (픽업서비스를 원하는 이용자 위치를 매장에
                전송하여 픽업위치로 주문한 제품 배송)
              </td>
              <td>온라인 주문 (웹사이트 및 모바일App) 방문포장만 적용</td>
              <td>회원만 제공</td>
            </tr>
          </table>
        </li>
        <li>
          <h3>제4조 이용자의 이용제한</h3>
          <ul>
            <li>
              (1) 이용자의 악의적인 개인위치정보 도용 및 결제사기를 목적으로 할
              경우 거절될 수 있습니다.
            </li>
            <li>
              (2) 이용자가 법률, 공공질서나 도덕에 위반하는 목적으로 서비스를
              이용할 경우에 거절될 수 있습니다.
            </li>
            <li>
              (3) 기타 관계법령 및 해당 약관을 위반한 경우에 거절될 수 있습니다.
            </li>
            <li>
              (4) 이용자가 회사 서비스 운영을 고의 또는 방해하는 경우에 거절될
              수 있습니다.
            </li>
          </ul>
        </li>
      </ul>
    </div>
  );
}
