import React, { useState } from "react";
import "../../css/law.css";
import PageTitle from "../../component/PageTitle";

export default function Shop() {
  const [props, setprops] = useState({
    title: "이용약관",
    nav1: "이용약관",
    nav2: "개인정보 처리방침",
    nav3: "위치기반 서비스 이용약관",
    nav4: "청소년 보호방침",
    nav5: "영상정보처리기기 운영관리방침",
    // breadcrumbLink: "/law",
    link1: "/law",
    link2: "/law/personal",
    link3: "/law/navi",
    link4: "/law/teen",
    link5: "/law/video",
  });
  return (
    <div className="content">
      {/* 페이지 타이틀 */}
      <PageTitle props={props} />
      {/* 본문 */}
      <p>도미노피자 서비스의 이용과 관련하여 필요한 사항을 규정합니다.</p>
      <ul className="law-use-content">
        <li>
          <h3>제1조 목적</h3>
          <p>
            이 약관은 청오디피케이㈜ (이하 “회사”)에서 운영하는 도미노피자
            웹사이트, 스마트폰 및 이동통신기기를 통해 제공되는 도미노피자 모바일
            웹사이트 (www.dominos.co.kr, 이하 “웹사이트”) 또는 모바일
            애플리케이션(도미노피자 이하 “모바일 App”)을 통해 제공되는 서비스의
            이용에 관련하여 권리 의무 및 관련 절차 등을 규정하고 상호 발전을
            도모하는 것을 그 목적으로 합니다.
          </p>
        </li>
        <li>
          <h3>제2조 정의</h3>
          <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
          <p>
            (1) “회원”이란 도미노피자 웹/모바일에 접속하여 본 약관에 따라
            회사에서 제공하는 서비스를 이용하는 고객을 말합니다.
            <br />
            (2) "아이디(ID)" 란 “회원”의 식별과 사이트에서 제공하는 서비스를
            이용하고, 회사가 회원을 구분, 식별할 수 있도록, 회원이 정하고 회사가
            승인하는 문자와 숫자의 조합을 의미합니다.
            <br />
            (3) ”비밀번호” 란 회원이 부여받은 아이디(ID)와 동일한 회원임을
            확인하고 비밀보호를 위해 회원 자신이 정한 문자 또는 숫자의 조합을
            의미합니다.
            <br />
            (4) “비회원”이란 회원에 가입하지 않고 사이트가 제공하는 일부서비스를
            이용하는 자를 말합니다.
            <br />
            (5) “이용자”란 웹사이트 및 모바일App에 접속하여 이 약관에 따라
            제공하는 서비스를 받는 회원 및 비회원을 말합니다.
          </p>
        </li>
        <li>
          <h3>제3조 약관의 게시와 개정</h3>
          <p>
            (1) 이 약관은 웹사이트와 모바일 App에 그 내용을 이용자가 알 수
            있도록 게시함으로써 효력을 발생합니다.
            <br />
            (2) 회사는 이 약관의 내용을 이용자가 쉽게 알 수 있도록 서비스 초기
            화면에 상호, 소재지, 대표자의 성명, 사업자등록번호, 연락처 등과 함께
            게시합니다.
            <br />
            (3) 회사는 약관을 개정할 경우, 적용일자 및 개정 사유를 명시하며
            약관에 동의하는 것은 정기적으로 웹사이트 및 모바일App에 방문하여
            약관의 변경사항을 확인하는 것에 동의함을 의미합니다.
          </p>
        </li>
        <li>
          <h3>제4조 약관의 해석</h3>
          <p>
            (1) 해당 약관에서 정하지 아니한 사항 및 이 약관의 해석에 대해서는
            전자상거래 등에서의 소비자 보호에 관한 법률, 약관의 규제 등에 관한
            법률, 공정거래위원회가 정하는 전자상거래 등에서의 소비자 보호지침 및
            관계 법령 또는 상관례에 따릅니다.
            <br />
            (2) 회사는 “약관의 규제에 관한 법률”, “전자거래 기본법”,
            “전자서명법”, “정보통신망 이용촉진 및 정보보호 등에 관한 법률”(이하
            “정보통신망법”), 개인정보보호법 등 관련법에 위배하지 않는 법위에서
            이 약관을 개정할 수 있습니다.
            <br />
            (3) 회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
            현행 약관과 함께 사이트의 초기화면에 적용일자 7일 이전부터 적용일자
            전일까지 공지합니다.
          </p>
        </li>
        <li>
          <h3>제5조 이용계약 성립</h3>
          <p>
            (1) 이용계약은 회원이 되고자 본 약관에 동의한 후 회사가 정한 양식에
            따라 회원정보를 기입하여 회원가입신청을 하고 회사가 이러한 신청에
            대하여 승낙함으로써 체결됩니다. <br />
            (2) 회사는 제1항과 같이 회원으로 가입신청 시 다음 각 호에 해당하는
            신청에 대하여는 서비스 제공을 거부하거나 제한할 수 있습니다. <br />
            <br />
            - 실명이 아니거나 타인의 명의를 도용하여 신청하였을 경우
            <br />
            - 허위 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우
            <br />
            - 관계법령에 위배되거나 미풍양속을 저해하고자 하는 목적으로 회원가입
            신청을 할 경우
            <br />
            - 신청자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반
            사항을 위반하여 신청하는 경우
            <br />
            - 만 14세 미만 미성년자
            <br />
            (3) 회원가입을 하지 않더라도 회원에게만 제공되는 서비스를 제외한
            일부 서비스를 이용할 수 있습니다. 비회원의 경우 회원에게 적용되는
            사항을 제외한 부분에 대해서는 동일하게 본 약관이 적용됩니다. 또한
            회사는 비회원 이용자 중 다음 각 호에 해당하는 이용에 대해서는 서비스
            제공을 거부하거나 제한할 수 있습니다.
            <br />
            <br />
            - 허위정보를 기재하거나 타인의 명의를 도용하여 이용할 경우
            <br />- 만 14세 미만 미성년자 (비회원 이용 시)
          </p>
        </li>
      </ul>
    </div>
  );
}
